chore: cleaned UI and changed diagram to mermaid
Signed-off-by: Alejandro Saucedo <alejandro.saucedo@zalando.de>
